// stores/universityStore.js
import { defineStore } from 'pinia'

export const useUniversityStore = defineStore('university', {
  state: () => ({
    universities: [
      "มหาวิทยาลัยเกษตรศาสตร์", "มหาวิทยาลัยจุฬาลงกรณ์", "มหาวิทยาลัยธรรมศาสตร์", "มหาวิทยาลัยสงขลานครินทร์", 
      "มหาวิทยาลัยเชียงใหม่", "มหาวิทยาลัยมหิดล", "มหาวิทยาลัยขอนแก่น", "มหาวิทยาลัยศรีนครินทรวิโรฒ", 
      "มหาวิทยาลัยรังสิต", "มหาวิทยาลัยหัวเฉียวเฉลิมพระเกียรติ", "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี", 
      "มหาวิทยาลัยราชภัฏพระนคร", "มหาวิทยาลัยกรุงเทพ", "มหาวิทยาลัยเทคโนโลยีสุรนารี", "มหาวิทยาลัยบูรพา", 
      "มหาวิทยาลัยนเรศวร","มหาวิทยาลัยพะเยา","มหาวิทยาลัยราชภัฏเชียงใหม่", "มหาวิทยาลัยราชภัฏนครราชสีมา", "มหาวิทยาลัยราชภัฏอุดรธานี", 
      "มหาวิทยาลัยราชภัฏอุบลราชธานี", "มหาวิทยาลัยราชภัฏสงขลา", "มหาวิทยาลัยราชภัฏยะลา", "มหาวิทยาลัยราชภัฏบุรีรัมย์", 
      "มหาวิทยาลัยราชภัฏสุรินทร์", "มหาวิทยาลัยราชภัฏลำปาง", "มหาวิทยาลัยราชภัฏลำพูน", "มหาวิทยาลัยราชภัฏเชียงราย", 
      "มหาวิทยาลัยราชภัฏนครสวรรค์", "มหาวิทยาลัยราชภัฏปทุมธานี", "มหาวิทยาลัยราชภัฏศรีสะเกษ", "มหาวิทยาลัยราชภัฏเพชรบุรี", 
      "มหาวิทยาลัยราชภัฏสระแก้ว", "มหาวิทยาลัยราชภัฏสระบุรี", "มหาวิทยาลัยราชภัฏสิงห์บุรี", "มหาวิทยาลัยราชภัฏตรัง", 
      "มหาวิทยาลัยราชภัฏบุรีรัมย์", "มหาวิทยาลัยราชภัฏชัยภูมิ", "มหาวิทยาลัยราชภัฏชัยนาท", "มหาวิทยาลัยราชภัฏขอนแก่น", 
      "มหาวิทยาลัยราชภัฏประจวบคีรีขันธ์", "มหาวิทยาลัยราชภัฏเพชรบูรณ์", "มหาวิทยาลัยราชภัฏร้อยเอ็ด", "มหาวิทยาลัยราชภัฏอำนาจเจริญ", 
      "มหาวิทยาลัยราชภัฏหนองคาย", "มหาวิทยาลัยราชภัฏหนองบัวลำภู", "มหาวิทยาลัยราชภัฏสุราษฎร์ธานี", "มหาวิทยาลัยราชภัฏมหาสารคาม"
    ]
  }),
  getters: {
    getUniversities: (state) => state.universities
  }
})
